Revit 2027 API
ParameterTypeId.PointElementSegmentLength Property
 "Segment Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointElementSegmentLength { get; }
Public Shared ReadOnly Property PointElementSegmentLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointElementSegmentLength {
	ForgeTypeId^ get ();
}
static member PointElementSegmentLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace